[{"cluster": 0, "keywords": ["compact", "gaming", "keyboard", "use", "work"], "reviews": [{"review": "Compact keyboard. Use for work & gaming", "sentiment": "neutral"}]}, {"cluster": 1, "keywords": ["keyboard", "key", "software", "press", "feel", "switches", "tactile", "use", "keys", "desk"], "reviews": [{"review": "Bought this past weekend to replace a MUCH cheaper off-brand 60% keyboard that lasted 3 years. This keyboard has a 2 year warranty out of the box so I'm expecting it to last at least that long if not twice that. Love the \"ghost\"/phantom keycaps, as I prefer to call the pudding style keycaps. Very classy, well made keyboard. Do wish it was a bit heavier/made sturdier/more rigid — it has lightweight aluminum top plate and a plastic bottom. I would've gone with steel bottom for extra weight. The keyboard could be a bit shorter, but it has about a 1/2\" lower \"lip\"/bezel that is basically just for more RGB effect and to show off the logo. Would've preferred not to have this as I'm used to using this with my laptop and my last keyboard would fit very comfortably over the lower part of my laptop keyboard where trackpad/palm rest is — this keyboard is just a tad too tall for my use case, I have to let it \"hang\"/overlap over the bottom edge of my laptop. I also transport it to work and use it at a regular desk which works as intended. I love that you can reprogram almost any key and even add a 2nd \"hypershift\" function to most keys, however you will need to use the Synapse 4 software which actually comes loaded into the keyboard ROM and will try to install itself when you first plug this in. The downside to the software is that some functions only work if you've got the software installed on the computer AND running in the background — can't install 3rd party software on most corporate/school machines, so you'll need to \"program\"/map out your keys on a personal machine and thankfully those keys bindings save to the keyboard ROM, AND you can save and cycle through about 3 or 4 whole profiles on the keyboard once you've made them in the software, they save and work on the keyboard even when switched to a machine with no software. This HOWEVER does NOT work for ANY of the lighting or macro recording features, so you'll be stuck with the stock color cycling mode when not using the keyboard on a machine with no software installed AND running — my cheap keyboard let you cycle through colors and lighting patterns/modes with keyboard shortcuts, this keyboard only lets you adjust the brightness, that's a #FAIL for Razer here for forcing us to install and use their software for simple and basic functions that SHOULD be built-in accessible. Other than those two gripes; (the taller than necessary dimension and required software for basic color control and macro usage,) I'm quite satisfied with the keyboard, it has softer/quieter \"orange\" key switches than the V3 TKL model with \"green\" key switches that I had to return a few days prior due to being too loud for my tastes and needing to use in an office setting. For reference my cheap no name keyboard used their own version of what are known as \"brown\" switches, well the orange are Razer's version of the browns, they're tactile with a very slight click sound, green switches are from my understanding Razer's version of a blue switch, which is very tactile and audibly clicky; they also make a switch available on some models that is yellow, that's like a red switch, which is a quiet and linear feel with no tactile sensation, just \"thocky\" from my understanding. Clicky feel/clacky sound=super tactile=blue/green. Slight clicky feel/much less clacky sound=average tactile feel=brown/orange. Mushy feel/thocky sound to silent=non-tactile/linear feel=red/yellow.", "sentiment": "positive"}, {"review": "I like the mini version as it claims very little space on my desk. This keyboard uses ‘fn’ key to access F1-F12 row and middle keypad. Keyboard is fully programmable and you can use Razer Synapse app to reprogram keys, add phonetic shortcuts (second layer), change RGB theme, etc. N-key rollover is used to invoke phonetic shortcuts. For example you can define “idk” as ”I don’t know” and then whenever you press i, d, k keys simultaneously the pre-defined text phrase will be expanded into text. Keyboard chip also scans the key matrix 1000 times per second and features anti-ghosting technology rejecting key presses that never actually occurred. I like key press weights and rates. It’s not linear, initially you need to apply some weight to press the key, but after a certain threshold the key gives up and easily falls down. I have 2 other mechanical keyboards which have linear spring rates and I feel the difference. I tend to accidentally press ‘ctrl’ key with my palm on the other keyboards, but this has that “click-clack” threshold that prevents that accidental press to occur. Keyboard has 3 way switch, to select Bluetooth, Hardwire or 2.4GHz connection mode. 2.4GHz dongle is tacked underneath the keyboard. Keyboard is also fully functional while being charged. It is also quite heavy and doesn’t move around the desk if you type quickly.", "sentiment": "positive"}, {"review": "This compact wireless keyboard packs a punch. The tactile switches feel great for typing and gaming, with a satisfying click that's not too loud. I love being able to hot-swap switches to customize the feel. The phantom pudding keycaps look sleek and really show off the vibrant RGB lighting. Battery life is impressive at 200 hours. The 65% layout takes some getting used to but saves desk space. Overall, it's a high-quality, feature-packed keyboard that's perfect for minimalist setups. The price is steep, but you get what you pay for in terms of performance and customization.", "sentiment": "positive"}]}, {"cluster": 2, "keywords": ["keyboard", "gaming", "mini", "solid", "blackwidow", "typing", "v4", "use", "wireless", "battery"], "reviews": [{"review": "This keyboard is IT. Coming from a MacBook Pro, I was worried the Razer BlackWidow V4 Mini wouldn’t give me that smooth typing vibe I’m used to, but man, it delivers and then some. The keys feel so satisfying to type on—responsive but not too loud—and setting it up was mad easy. Bluetooth is seamless, and the HyperSpeed Wireless? No lag at all. What sold me, though, is how versatile it is. I needed something I could use for work during the day and gaming at night, and this thing handles both flawlessly. It’s professional enough to bring to a meeting without looking extra but still has that RGB sauce to pop when you’re gaming. This is hands-down the best mini keyboard on the market. Whether you’re typing essays, coding, or racking up dubs in a game, the BlackWidow V4 Mini is the truth.", "sentiment": "positive"}, {"review": "If you are in need of a quality gaming keyboard that is smaller than a traditional full sized keyboard this is a great option. The BlackWidow V4 is a solid mechanical gaming keyboard that is 65% the size of a full sized keyboard. You can swap out the switches making this easy to customize. Additional customizations can be made via the software. Battery life is solid as well. This is priced at the entry level for a wireless mechanical gaming keyboard so while not cheap it is definitely cheaper than the higher level keyboards. Typing and gaming on this keyboard is fantastic. You can use the wireless dongle or bluetooth to connect as well as use it while plugged in (so if your battery dies you can still game while charging). Overall another very solid option from Razer!", "sentiment": "positive"}]}, {"cluster": 3, "keywords": ["aside", "battery", "better", "bluetooth", "exactly", "hot", "previous", "really", "say", "swappable"], "reviews": [{"review": "Exactly the same as the previous version but hot swappable. The Bluetooth is updated and the battery is better, but aside from that there’s not really much else to say.", "sentiment": "positive"}]}]