[{"reviews": "My daughter loves Toy Story so we got her the toys from it. This rex toy is great. It had the detachable tail like the movie. It has a button on the back that makes him talk, moves his jaw and arms. Legs are moveable. It’s fun, made well, and true to movie size.", "sentiment_type": "positive"}, {"reviews": "This is the best biz I could find. The biggest thing I wanted was pop-out wings like the movie and like I had as a kid. The laser lights up, even the arm flap opens like the movie. Has karate chop and 50% retractable helmet. This thing is awesome and for a good price. The ones in local stores don’t have wings that pop out and I feel bad for kids who get those duds. I was so happy to buy this and give it to my 1.5 year old. I’m sure he’s like WTF is this thing, but I couldn’t wait I had to buy this [awesome Buzz] and give it to him.", "sentiment_type": "positive"}, {"reviews": "Great quality. Great Value. Colors were accurate and as pictured. Perfect size", "sentiment_type": "positive"}, {"reviews": "It works exactly as described. Good quality and easy to use. Arrived on time and in perfect condition. I definitely recommend it.", "sentiment_type": "positive"}, {"reviews": "I was so surprised..it was big and awesome…as nice as the Buzz Lightyear I bought at the Disney store in Disney World very very happy with my purchase!", "sentiment_type": "positive"}, {"reviews": "The media could not be loaded. My toddler girl who is almost 3 loves this Buzz! She loves Toy Story (all the movies) and became infatuated with Buzz Lightyear. I wanted to get her a decent size buzz so she could carry him around - not a small one or a stuffed one. I put my hand next to buzz to show the size ratio - the overall quality is amazing. Strong and sturdy no matter how many hits or falls. His face is soft plastic so it has a difference between his body and face (ignore the coloring my daughter did on his face lol). His voice is clear and accurate - the battery has not run out after plenty of use. Overall worth the price for an interactive BIG buzz.", "sentiment_type": "positive"}, {"reviews": "Cool toy, but since this is a gift I’m bummed that the box arrived damaged.", "sentiment_type": "positive"}, {"reviews": "My daughter has been obsessed with Toy Story so we had to get her this woody. The details are exactly like the movie. Good quality material that you can tell is going to hold up even with a lot of play. She won’t go to bed without it. We even got her the buzz light year and Zurg. There’s a cool setting that recognizes the other characters and has specific voice lines depending on the other character.", "sentiment_type": "positive"}, {"reviews": "The media could not be loaded. Llegó en excelentes condiciones sin problemas todo bonito,solo que viene el idioma en inglés pero de ahi en fuera todo 10/10 y a precio accesible", "sentiment_type": "negative"}, {"reviews": "Ótima qualidade do produto", "sentiment_type": "neutral"}, {"reviews": "My grandson loves loves his Buzz Light Year he was so excited. It strong and solid great investment worth every cent", "sentiment_type": "positive"}, {"reviews": "Excelente vendedor recomendable, excelente producto", "sentiment_type": "neutral"}, {"reviews": "Alors là rien à dire je l’ai acheté pour ma fille qui adore Toy Story elle l’aime tellement qu’elle en dort avec Woody la nuit il est super bien fait et bien grand", "sentiment_type": "positive"}]