[{"reviews":"I do like these figures.  Heck, I even installed the brick search app on my phone to be able to scan the QR codes if/when I found a store with them in stock. I ordered two boxes as well from Amazon as well.  Unfortunately, there are plenty of repeats.  2 or 3 of the same figure in a box of 6 is disappointing.  Lego isn't really great about mixing the figures up before putting them in the boxes of 6.  An acquaintance of mine bought a box of 6 and four of them were Strahd. Even the one time I found some in a brick and mortar store, of the 9 they had, 3 were the Arrakocra Ranger and two were Tasha.  Fortunately, that's one of the ones I really wanted.  I still haven't been able to find the Dragonborn paladin, though. Again, the brick search phone app is very handy if you come across the figures in an actual store.  You can find out what's in the package without opening or messing it up. So five stars for the mini figures.  They're awesome.  The randomness though...eh..","sentiment_type":"positive"},{"reviews":"If you are the type of person who likes legos and D&D, then you're gonna love these. The pieces can be endlessly swapped to create different characters for dioramas or even custom minis for your campaign. However, please note that there are 12 minis, but each box has a non-random assortment of six. This means you could get them all in as little as two six packs, but each six pack will have the same set (either set A or set B) each time. Plan accordingly!","sentiment_type":"positive"},{"reviews":"I bought 24 of these from the Lego website trying to get 2 full sets, but I was still missing 3 of the 12 characters. So I came here to see if this series would be divided into half of the twelve per box with no repeats and I was pleasantly surprised that I lucked out and got all 12! So here is exactly what I got: I bought 3 of these boxes with the BOX 1 having the Teifling Warlock, Dwarf Barbarian, Aaracokra Ranger, halfling Druid, Elven Bard, and Dragonborn Paladin. BOX 2 had Strad, the Ilithid, the Gith Rogue, Tasha the Witch, and the weird one that I can’t remember the name of (tall green lady with frills). So no duplicates and a full set. So I was expecting box three to be an exact copy of either box 1 or 2 but it wasn’t, instead BOX three had the Druid, Teifling, Dragonborn, Tasha, the Gith, and the tall Green Lady again meaning I got an even split of the first two boxes, though still with no repeats within the same box which is great! I’m not sure if I got lucky with getting a full set this time or if you are Likely to get all 12 if you buy 2 or more boxes. Either way I recommend buying these figures this way if you don’t want to hunt for them in an actual store","sentiment_type":"positive"},{"reviews":"First, I realize how incredibly lucky I was to get all 6 of the \"heroes\" in one box. Second, these are amazing.  LEGO has done a great job with their minifigure collections over the years and this is no different.  Each of the figures had a masculine and feminine head with two faces on each (except the paladin).  It's neat to be able to choose a \"battle\" face or a \"normal\" face.  The accessories were great too! Now I have to decide if I'm going to chance getting all of the villains.","sentiment_type":"positive"},{"reviews":"These are so much fun to open. My daughter collected this because she loves D&D, and she received 6 different figures… the first she opened happened to be a bard (her favorite class) and she also found Strahd! All of the pieces were included along with a little collection chart. Very fun.","sentiment_type":"positive"},{"reviews":"Loved the figures and designs. As a fan of both LEGO and Dungeons & Dragons, this set is a welcome surprise. I only wish we had more in this first wave! However, I bought two of these “randomized” 6-packs and both had EXACTLY the same assortment of figures. Had I known this would be the case, I would have sticked to single packs after opening the first one.","sentiment_type":"positive"},{"reviews":"3 out of the 6 minifigures were Mind Flayers. Great for building out an invasion, terrible for variety. I know these are blind box, but I was at least expecting the contents of a \"Box of 6\" to be 6 different minis. Additionally, the Strahd (vampire) I received had 2 sets of legs, and no torso. The quality on all of the minifigures is quite nice, however. Box contained: Mind Flayer, Mind Flayer, Mind Flayer, Dwarf Barbarian, Elf Bard, and Half of a Strahd. Purchased for self, 34y/o F, will still definitely use these in a Dungeons and Dragons game, my players will just have to keep fighting off mind flayers, I suppose!","sentiment_type":"positive"},{"reviews":"The six minifigures that you get from this box (of the four that I have purchased as of writing) were all unique to the box they came in. There seems to be a standard form, where you can either get: Barbarian, Ranger, Bard, Mind Flayer, Szass Tam, and Baron Strahd /Or/ Paladin, Lady of Pain, Sorcerer, Druid, Tasha, and Warlock. (Again, of the four boxes I purchased, this was the layout.) The figures are HIGH quality, with no major drawbacks and a good addition to any collection.","sentiment_type":"negative"},{"reviews":"Todo excelente. Esta caja si cumple con lo visto en las reseñas. Compre una caja y ninguna figura salio repetida.","sentiment_type":"neutral"},{"reviews":"I recently purchased the Dungeons and Dragons 6-pack of LEGO mini figures, and I couldn’t be more thrilled with the set! The highlight for me was the Dragonborn Paladin—its design is incredibly detailed, capturing the essence of both the D&D universe and the fun, playful nature of LEGO. What impressed me the most was that there were no duplicates in the pack, which can sometimes be an issue with collectible sets. Each minifigure had its own unique style and personality, making it perfect for customizing characters for tabletop play or just displaying. Overall, this set is a great value for both LEGO and Dungeons & Dragons fans. It adds a whole new level of fun to my game nights, and the quality of each minifig is outstanding. Highly recommend!","sentiment_type":"positive"},{"reviews":"No worries about getting duplicates, as there are enough accessories to allow a great mix and match of minifigs to create new options.","sentiment_type":"positive"},{"reviews":"BUEN PRODUCTO","sentiment_type":"neutral"},{"reviews":"I purchased two of these boxes at different times, because the guarantee that each box will have 6 unique characters is amaxing for me. The second box had the same as the first, so I have some unopened minifigs to gift or trade. The rest I figured out doing a tiny bit of science at a little bookstore that has low traffic and lets me shake boxes, heh. I get most of my minifigs there. The ones on the top level and the ones on the bottom level were the different boxes, and they went in sets of 3. I've since found a phone app that tells you what's in each single minifig box, so that's awesome. I don't go to collect full sets very often, but this was one that had huge sentimental value to me. My first copy of D&D was purchased the only way possible -- by going to Gary Gygax's house and buying it directly from him. Over the last 40+ years, through many Gen Cons and video games and online tabletops, it has been a place to make friends and go interesting places and loot very interesting items. Everyone has D&D stories. I love the stories we create, and they're all unique. I've loved getting to pass this on and share with cousins, nieces and nephews as they've gotten interested! Forgotten Realms has been a setting near and dear to my heart, and not just because Ed Greenwood has lived pretty much down the road from me for several decades. I love the Harpers, I love some if the simpler there-is-evil-and-we-can-fight-it, I love the more complex \"people are complicated\". I had all of the physical novels at one point, was pretty thrilled when they were released as ebooks, and a bunch are even audiobooks as of recently! It's been so fun to return to such a beloved setting. When Lego released this set, the fact that I knew who half of the characters were made me overjoyed. The addition of really cool characters like a Dragonborn and a Tiefling are delightful. The tiny dragon? Perfection. So I wound up with 4 or 5 tieflings the way things turned out, but I am SUPER okay with that as I now have a little flight of tiny dragons! I haven't had lego dragons since I gave my old Castle sets to cousins decades ago. The Bard, btw, is Haer'dalis and you can't change my mind, so I guess there's also Ravenloft and Planescape in here.","sentiment_type":"positive"}]