[{"reviews":{"reviews":[{"content":"This set is absolutely amazing! I wanted ot so badly, and got it on sale during Black Friday, making it even more with its price. The build was easy, but a bit time consuming, however that was worth it for the large and nicely put together build. The entire bottom plate form is a well structurally built combination of smaller pieces, making it one of the reasons it is time consuming, but it also makes for a large enough platform for the scene below the tall neck. The watcher is nice, its legs are a bit inflexible making it necessary to get it angled correctly to look legitimately like a watcher, but it wasn’t to hard once you popped it onto its spot on the platform. The Aloy figure is very cool. My only complaint is the spear she has doesn’t stay put together well, coming easily apart if you slightly nudge it. The hairpiece she has is great, but Lego does not sell its replacement, so it’s necessary to be super careful with it (I had a friend who lost theirs so I know from second hand experience what a pain it is). Overall I am incredibly satisfied and love this product. Read more"},{"content":"I enjoyed the detail and design of this Lego set. Wish they would release more Lego Horizon sets. Great value for the product and well made. Great gift or set for those who enjoy the Horizon games. Read more"},{"content":"It’s really hard to believe how incredibly good this mech looks for a Lego adult set under $100! The building techniques are just awesome. The Tallneck looks very imposing and highly detailed. This is not a set for kids, but you can share the building experience with your kid. The mini figure and base are just perfect. A very fun building experience and a spectacular display model. Highly recommended por any Lego and Horizon video game enthusiasts. Read more"},{"content":"It is fun to build and looks good. Read more"},{"content":"This is perfect for fans of the franchise. There are enough pieces to keep you entertained for at least a few hours. No missing pieces in my set and looks great on a shelf. Read more"},{"content":"As a fan of the Horizon series, I love this set. Building it was fun, instructions were clear, and it stands proudly on display in my home. No regrets. Read more"},{"content":"What an awesome Lego. The build was pretty easy and it turns out to be a fairly tall set once completed . This Set is the Tallneck based from The Horizon Forbidden West Video game . Definitely a beautiful one to add to a Lego collection or a fan of the video game . Read more"},{"content":"If you are a Lego fan, just buy it already. The attention to detail is amazing. Also a big fan of the game. Read more"},{"content":"Produto muito lindo, cheio de detalhes.  A montagem é muito bem detalhada, deixando bem proveitosa a montagem. Depois de finalizado, é um item incrível para deixar exposto em qualquer canto gamer! Read more"},{"content":"Sí te gusta el diseño del mundo de Horizon y sus criaturas te va a encantar. Read more"},{"content":"We all know Lego can be pricy.... but this one is absolutely worth it. I bought it as a gift for a family member and it was such a joy watching them build it. The model and design of this set is so sleek and accurate to the game's design of a Tallneck. The finished product is the perfect size, perfect for a cool display. Took her a few hours to build, and was very happy with the final product. My favorite part was seeing the minifigure sword pieces used as the flappy things and the mini mini watcher. If anyone you know is a fan of the game + Lego I would most definitely recommend! Read more"},{"content":"Absolut empfehlenswert. Read more"},{"content":"Exatamente igual à foto. Demorei alguns dias para montar, mas assim que terminei tive uma certeza: tinha que colocar ele em um expositor. Dito e feito - é uma peça que merece ficar exposta (e não pegar pó). Ficou simplesmente maravilhoso, compraria de novo 1000x. Read more"}]},"sentiment_type":"neutral"}]