[{"reviews": "My PSP came in pristine condition as if it came straight from the manufacturer brand new. The shipping was A1. It was well protected and work phenomenal.", "sentiment_type": "positive"}, {"reviews": "I’m speechless this is a replacement PSP for my limited edition Darth Vader 2000 series yes this a 3000 series PSP and I’m blown away it looks brand new the OG battery doesn’t want to seem to charge with the original charger so I’m using the charger supplied with the PSP and I thought I was going to have to replace the shell in case I didn’t like it I love it it looks new yes the blue ring on the back has scratches on it it looks like I had it for a few months looks better than my PSP 2000 series yes I put darth Vader on my 3000 series psp it fits so why not the OG cover was flawless I happen to like Vader better lol. Sorry this is so long of a review I’m just shocked it looks damn near perfect. Absolutely gorgeous if you want a blast from the past handheld console this is it", "sentiment_type": "positive"}, {"reviews": "We purchased the product for our son for Christmas.  When we received the product it was flimsy and dirty.  Our son tried to start the product but it would not come on.  We immediately sent the product back to the seller.  We assumed, incorrectly, that both the seller and Amazon would stand by the product.  We were within the return period and purchased a warranty as well.  Once we returned the product the warranty was voided as well.  The seller accused us of trying to modify the item, which was an absolute lie.  We were refunded shipping costs and nothing else.  I would encourage everyone to not purchase items from this seller.  There are other ratings that support my experience.  In addition, we reached out to Amazon about this experience at least three times.  Although the notes regarding or exchange with both the seller and Amazon was available no one seemed to be able to understand that the seller sold a defective product.  Honor what you sell in your site.", "sentiment_type": "positive"}, {"reviews": "Missed mine when I first got it 14 years now and I’m playing classic I’ve never even played. UMD drive still works and sounds great only down side back piece for battery doesn’t stay on the best. Other than that everything is good for me", "sentiment_type": "positive"}, {"reviews": "One thing that upset me is that the product description says it comes with two batteries, but it only came with one. Other than that, the system was in decent condition. Everything works, and the shell doesn't have any serious dents or scratches. The screen has a yellow tint to it, and the circle button doesn't have the same resistance as the other buttons, but that's expected from a used system. The system came with some dust in the creases that I had to clean using a brush.", "sentiment_type": "positive"}, {"reviews": "Came in Excellent shape. Looks and plays like new. Thank you.", "sentiment_type": "positive"}, {"reviews": "I was happy to finally get a psp again to enjoy a little high school days nostalgia. Upon arrival the psp itself was in great shape. Noticing that it only came with one battery rather than the 2 that is listed in the description, I was already a little disappointed rite off. Being happy just to have a psp I didn't let it bother me much, however shortly after turning it on and playing a few missions of my favorite psp game, Vice City Stories, it randomly shut off completely without warning and wouldnt turn back on. I feared the worst but after some minor youtube research I figured out that the single battery it came with was not only super cheap and prone to spontaneous power cuts, it was also the lowest amp hour of only 800 mAh that you can get for the psp. So after removing the battery and powering it on using the charging cord only, I was able to get it going again. After getting the battery reinstalled and powering the device, it happened again not long after. I'm glad to finaly have the psp of my childhood so overall I'm keeping it without much other complaint for now. I ordered another battery that will be here in a few days and hope it's the only problem I have with it. I don't normally leave reviews but for the price of these (about $60 more than anywhere else online) I thought I was paying for the assurence of getting everything promised with no question of problems, especially on the first day. If the seller reads this and wants to make it rite and send me a quality battery I will gladly remove this post and give it 5 stars because it is in great shape and came 2 days early. As for now, it's 3 stars for first day problems and losing progress in an unsaved game", "sentiment_type": "positive"}, {"reviews": "I give it 5 stars", "sentiment_type": "neutral"}, {"reviews": "The media could not be loaded. Compre esta consola para volver a jugar mis videojuegos favoritos y no ha sido posible. Desafortunadamente, no lo utilice hasta ahora y me doy cuenta que el PSP no reconoce ninguno de mis discos. Solo regalé mi dinero. No funciona. Inservible.", "sentiment_type": "positive"}]