[{"reviews": "I love this thing! It was easy to assemble compared to my other kids bikes (bmx, toddler elsa bike with training wheels and huffy). Its so sturdy. I have two boys diagnosed with ADD/ADHD ages 5 and 7. They break everything. Makes me cry. This thing has endured my two boys. That's saying something. All my kiddos have taken their turn inside, ages 8, 7, 5, 3, and 2. Why my older ones ride in it. I don't know. I'm so glad its sturdy though. My two year old daughter, whom it was attended, for loves it. She'll drive it around inside the house and out in the yard. The steering wheel does not direct the car. The little horn is cute. Its a soft high tone. Better than hearing my kids bikes horns. The tire wheels do not squeak. I did not put the stickers on because I knew my kids would rip them off. So I can't say anything about the stickers. It can go pretty fast. My kids will push it while running. Since its little kids pushing it around you know its not heavy. I recommend this if you want a sturdy toy. It’s loud on pavement. I don’t care. It’s better than hearing their other noisemaking toys.", "sentiment_type": "positive"}, {"reviews": "Super easy to put together! Like that it came with stickers fo decorate the car. And the hood has storage and two cups holders! My son has so much fun going for walks in it", "sentiment_type": "positive"}, {"reviews": "My baby was eager to ride and he was thrilled! Would definitely buy again or gift to someone. Very sturdy and safe for baby’s and toddlers!", "sentiment_type": "positive"}, {"reviews": "Very good fast shipping", "sentiment_type": "positive"}, {"reviews": "Perfect car for toddler and parents", "sentiment_type": "positive"}, {"reviews": "I bought this for a one year old. She fits into it perfectly. She is about 24 inches tall. I think she can use it until she’s about 29 imches tall, but after that, it would be too cramped for leg room. The helper handle on the back is genius! It saves me from leaning over to push her. The car doesn’t have any pedals and there’s no  way she could propel herself to move the car because of its design. We plan to take her out on the sidewalk with it and around the neighborhood. I’m sure it’ll be more of a bumpy ride on rough concrete. Definitely made for indoors if you’re looking for a smooth ride. I love the frunk (front trunk). She can put her toys in there. There’s also two cup holders! This was definitely worth the money.", "sentiment_type": "positive"}, {"reviews": "We love this purchase, my daughter loves it as well. However, the wheels are plastic and are very loud when on cement or concrete. It hasn’t prevented us from using, but it is a little annoying…other than that we love it and are happy with this purchase. (Cup holder does NOT fit a child yeti thermas)", "sentiment_type": "positive"}, {"reviews": "Perfect gift for a 1 year old. My daughter loves driving around the neighborhood in this. It does come in a ton of pieces and needs some assembly. But it’s light weight and fun for her.", "sentiment_type": "positive"}, {"reviews": "montable en perfecto estado y nuevo..... a mi hijo le encanto.. es resistente y muy bonito", "sentiment_type": "positive"}, {"reviews": "It said it was for ages 18 months to 3years but I bought it for a 2 year olds birthday and she found it quite difficult to get in because the foot rest was a little small. Other than that great quality, Sturdy and easy(ish) to build. Fast customer service response aswell.", "sentiment_type": "positive"}, {"reviews": "ممتازة وعملية", "sentiment_type": "neutral"}, {"reviews": "My baby is in love with it.. thanks", "sentiment_type": "positive"}, {"reviews": "Muy fácil de armar , mi hijo de 18 meses cabe Perfecto y el cinto de seguridad lo mantiene sentadito. A mi hijo le encanta , es su juguete favorito hasta ahorita . Es muy fácil de empujar y manipular la dirección desde atrás . Lo único que no me gusta es que las llantas son rígidas y hace mucho ruido en pavimento no tan liso. Lo recomiendo mucho.", "sentiment_type": "positive"}]